{"data":{"site":{"siteMetadata":{"title":"My Blog"}},"allMarkdownRemark":{"edges":[{"node":{"excerpt":"I further modified the schema this week, removing the count table. I’ve reviewed backend code for phase two, as well changes to the phase…","fields":{"slug":"/10/"},"frontmatter":{"date":"March 25, 2019","title":"Tenth Post"}}},{"node":{"excerpt":"I spent a lot time this week preparing for a job interview - in fact I’m writing this post from an Amtrak train right now. I made a count…","fields":{"slug":"/9/"},"frontmatter":{"date":"March 21, 2019","title":"Ninth Post"}}},{"node":{"excerpt":"I finished the all of UI facade last week. This week I reviewed code and worked on a new table for the db to store counts.  The new table…","fields":{"slug":"/8/"},"frontmatter":{"date":"March 14, 2019","title":"Eighth Post"}}},{"node":{"excerpt":"This past week I tried to move onto the UI team. I was expecting to help them integrate with the backend api points, as I’m familia with…","fields":{"slug":"/7/"},"frontmatter":{"date":"February 26, 2019","title":"Seventh Post"}}},{"node":{"excerpt":"This week backend stubs were merged and tickets were cut for endpoints. We used GitHub issues to create the tickets and Projects to track…","fields":{"slug":"/6/"},"frontmatter":{"date":"February 20, 2019","title":"Sixth Post"}}},{"node":{"excerpt":"This week we started stubbing out the backend code. It’s looking alright.   makes it hard to implement some concepts of SOLID, as   has it’s…","fields":{"slug":"/5/"},"frontmatter":{"date":"February 13, 2019","title":"Fifth Post"}}},{"node":{"excerpt":" \n This week our group split into two teams, Frontend and Backend (which also includes DB). I started working on our development environment…","fields":{"slug":"/4/"},"frontmatter":{"date":"February 07, 2019","title":"Fourth Post"}}},{"node":{"excerpt":"This was a good week. Our group, team red, met yesterday ahead of our meeting in class this Thursday\nto talk more about our requirements and…","fields":{"slug":"/3/"},"frontmatter":{"date":"January 29, 2019","title":"Third Post"}}},{"node":{"excerpt":"Another week, more NPM mishaps. Javascript is the worst and I hate it. Making this websites has got me thinking more about the requirements…","fields":{"slug":"/2/"},"frontmatter":{"date":"January 25, 2019","title":"Second Post"}}},{"node":{"excerpt":"My goals for this week were to iron out the kinks in my deploy process for this blog and connect with my team to start discussion on…","fields":{"slug":"/1/"},"frontmatter":{"date":"January 18, 2019","title":"First Post"}}}]}},"pageContext":{}}